In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [7]:
df = pd.DataFrame(data)

In [9]:
bycomp = df.groupby('Company')

In [10]:
bycomp

In [19]:
bycomp.mean('Sales')

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [21]:
bycomp.sum('Sales')

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [26]:
bycomp['Sales'].std()

Company
FB       75.660426
GOOG     56.568542
MSFT    152.735065
Name: Sales, dtype: float64

In [28]:
bycomp.sum('Sales').loc['FB']

Sales    593
Name: FB, dtype: int64

In [29]:
df.groupby('Company').sum('Sales').loc['FB']

Sales    593
Name: FB, dtype: int64

In [30]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [31]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [32]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [33]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0